Revit 2026 API

# CableSizeComments Property

---

The comments of this Cable Size.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Comments { get; set; }
```
```vb
Public Property Comments As String
	Get
	Set
```
```cpp
public:
property String^ Comments {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Comments : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

CableSize Class

Autodesk.Revit.DB.Electrical Namespace